import java.util.Scanner;

public class ChatBot {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        boolean inprocess = true;
        String name;

        System.out.println("თქვენი სახელი?");
        name = scanner.next();
        System.out.println("გამარჯობა," + name + ". მე ბიზნესისა და ტექნოლოგიების უნივერსიტეტის " +
                "ციფრული ასისტენტი ვარ. \nრა გაინტერესებთ?\n1)პროგრამები 2)პერსონალი 3)კარიერა 4)ბიბლიოთეკა");
        String input;

        input = scanner.next();
        if(input.equals("პროგრამები") || input.equals("programebi"))
        {
            System.out.println("სტუდენტებისთვის შეთავაზებულია საგანმანათლებლო პროგრამები უმაღლესი განათლების სამივე საფეხურზე,\nბაკალავრიატი, მაგისტრატურა და დოქტორანტურა. რომელი გაინტერესებს?");
            input = scanner.next();
                    if(input.equals("ბაკალავრიატი") || input.equals("bakalavriati")){
                        System.out.println("ბაკალავრიატის პროგრამებია:  \nბიზნესის ადმინისტრირება (მენეჯმენტი) \nბიზნესის ადმინისტრირება (ფინანსები)\nციფრული მარკეტინგი\nსაინფორმაციო ტექნოლოგიები");
                        System.out.println("მე მხოლოდ ამ ინფორმაციის მოწოდება შემიძლია. სხვა შემთხვევაში მიმართეთ ოპერატორს.");
                    }
                    else if(input.equals("მაგისტრატურა") || input.equals("magistratura")){
                        System.out.println("მაგისტრატურის პროგრამებია:  \nბიზნესის ადმინისტრირება და თანამედროვე ტექნოლოგიები\nინფორმაციული სისტემების მართვა - DEVOPS\n");
                        System.out.println("მე მხოლოდ ამ ინფორმაციის მოწოდება შემიძლია. სხვა შემთხვევაში მიმართეთ ოპერატორს.");

                    }
                    else if(input.equals("დოქტორანტურა") || input.equals("doqtorantura")){
                        System.out.println("დოქტორანტურის პროგრამებია:  \nციფრული მმართველობა და ხელოვნური ინტელექტი საჯარო სექტორში\nბიზნესის ადმინისტრირება");
                        System.out.println("მე მხოლოდ ამ ინფორმაციის მოწოდება შემიძლია. სხვა შემთხვევაში მიმართეთ ოპერატორს.");

                    }
                    else{
                        System.out.println("რას გულისხმობთ ვერ გავიგე. დაუკავშირდით ოპერატორს ცხელი ხაზით.");
                    }
        } else if (input.equals("პერსონალი") || input.equals("personali"))
        {
            System.out.println("ბიზნესის და ტექნოლოგიების უნივერსიტეტის პერსონალია: ");
            System.out.println("მე მხოლოდ ამ ინფორმაციის მოწოდება შემიძლია. სხვა შემთხვევაში მიმართეთ ოპერატორს.");
        }
        else if (input.equals("კარიერა") || input.equals("kariera")){
            System.out.println("რა გაინტერესებთ კარიერაზე? \nსტუდენტებისთვის\nკურსდამთავრებულებისთვის\nპარტნიორებისთვის");
            String nextinput = scanner.next();
            if(nextinput.equals("სტუდენტებისთვის")){
                System.out.println("ბიზნესისა და ტექნოლოგიების უნივერსიტეტის კარიერული განვითარების ცენტრი მთელი წლის განმავლობაში სტუდენტებსა და კურსდამთავრებულებს უწყვეტ რეჟიმში სთავაზობს კარიერული მხარდაჭერის სხვადასხვა შესაძლებლობას. " +
                        "კარიერული განვითარების ცენტრი პირველივე სემესტრიდან იწყებს სტუდენტებთან " +
                        "ინტენსიურ მუშაობას და აგრძელებს მათთან თანამშრომლობას სწავლის დასრულების შემდგომაც. " +
                        "BTU-ს კურსდამთავრებულები მუდმივად იღებენ შეთავაზებებს სხვადასხვა ვაკანსიის,  ტრენინგისა და კვალიფიკაციის ასამაღლებელი პროგრამის შესახებ.\n" +
                        "\n" +
                        "კარიერული განვითარების ცენტრი წელიწადში რამდენჯერმე " +
                        "მიმართულებების მიხედვით მართავს მასშტაბურ დასაქმების ფორუმს, რომელშიც მონაწილეობენ წამყვანი ადგილობრივი და " +
                        "საერთაშორისო პარტნიორი კომპანიები. აღნიშნული ფორუმების ფარგლებში სტუდენტებისათვის სემესტრების მიხედვით იხსნება წვდომა პროგრამის შესაბამის ვაკანსიებსა და სხვადასხვა სახის შეთავაზებაზე. დასაქმების ფორუმში მონაწილეობა შეუძლიათ როგორც სტუდენტებს, ასევე კურსდამთავრებულებს.");
            }
            else if(nextinput.equals("კურსდამთავრებულებისთვის")){
                System.out.println("უწყვეტი განათლების პროგრამა, საკონსულტაციო სერვისები კარიერული განვითარებისათვის");
                System.out.println("მე მხოლოდ ამ ინფორმაციის მოწოდება შემიძლია. სხვა შემთხვევაში მიმართეთ ოპერატორს.");
            }
            else if(nextinput.equals("პარტნიორებისთვის")){
                System.out.println("იპოვე შესაფერისი კანდიდატი\nმიიღე მონაწილეობა ღონისძიებაში");
                System.out.println("მე მხოლოდ ამ ინფორმაციის მოწოდება შემიძლია. სხვა შემთხვევაში მიმართეთ ოპერატორს.");
            }
        }
        else if (input.equals("ბიბლიოთეკა") || input.equals("biblioteka")){
            System.out.println("უნივერსიტეტში არის ბიბლიოთეკა, ასევე ელ. რესურსები და ცოდნის ბანკი ");
            System.out.println("მე მხოლოდ ამ ინფორმაციის მოწოდება შემიძლია. სხვა შემთხვევაში მიმართეთ ოპერატორს.");
        }
    }
}
